# coding=utf-8

# 以泳装8期为例

# 材料按金银铜排序
# 自有：满破礼装数量，未破礼装数量（非负整数）
my_cards_limit_full, my_cards_limit_un = [1, 2, 2], [2, 4, 5]
# 助战：是否能借到加成礼装，是否能借到满破加成礼装（1/0）
support_available, full_support_available = [1, 1, 1], [1, 1, 1]
# 过本基础获取
a = [[0,    7.18,   45],
     [7.31,   45,    0],
     [44.9,    0, 7.21],
     [27.7, 27.7, 27.6],
     [33.3, 33.2, 33.2]]
# 礼装额外获取
b = [[   0, 2.39,   15],
     [2.43,   15,    0],
     [14.9,    0,  2.4],
     [9.23, 9.24, 9.22],
     [11.1, 11.0, 11.0]]
# 关卡名称
level_name = ["80","85","90","90+","90++"]
# a的行数，b的行数，level_name的长度相同
# 材料需求，已有材料
all_demond = [2100, 2700, 3720]
now_own = [72, 242, 213]


# 参考输出

# Success
# Minimum number of times: 35.0

# Summary:
# level 80	 a=[ 0.    7.18 45.  ]	 b=[ 0.    2.39 15.  ]

# level 85	 a=[ 7.31 45.    0.  ]	 b=[ 2.43 15.    0.  ]

# level 90	 a=[44.9   0.    7.21]	 b=[14.9  0.   2.4]

# level 90+	 a=[27.7 27.7 27.6]	 b=[9.23 9.24 9.22]

# level 90++	 a=[33.3 33.2 33.2]	 b=[11.1 11.  11. ]
# nums: 6.0	 gain: [4 2 6]	 num_card: [2 1 3]
# nums: 16.0	 gain: [2 2 8]	 num_card: [1 1 4]
# nums: 13.0	 gain: [2 6 4]	 num_card: [1 3 2]